СистемаЛиквидацииАкадемическихЗадолженностей/src/Documents/РекомендацииПоСтудентам/РекомендацииПоСтудентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РекомендацииПоСтудентам</name>
  <basedOn>Document.ВедомостиОСистемеАкадемическихЗадолженностей</basedOn>
  <basedOn>Document.ВедомостиОСистемеАкадемическихЗадолженностейДляСтудентовсИОМ</basedOn>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>EnumRef.ФормаОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Рекомендация</name>
    <type>
      <types>EnumRef.РешениеКомиссии</types>
    </type>
  </attributes>
</mdclass:Document>

СистемаЛиквидацииАкадемическихЗадолженностей/src/Documents/РекомендацииПоСтудентам/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НаправленияНаПересдачу") Тогда
		// Заполнение шапки
		Группа = ДанныеЗаполнения.Группа;
		ДатаСоставления = ДанныеЗаполнения.ДатаВыдачи;
		СрокЛиквидации = ДанныеЗаполнения.ДатаПроведения;
		Студент = ДанныеЗаполнения.Студент;
		ФормаОбучения = ДанныеЗаполнения.ФормаОбучения;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
